bit-finance/Documents/бит_НазначениеПравилТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_НазначениеПравилТрансляции</Name>
			<BasedOn>
				<xr:Item>Catalog.бит_ПравилаТрансляции</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_НазначениеПравилТрансляции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаСтруктурныхПодразделений</Name>
					<Comment>Группа структурных подразделений</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ГруппыСтруктурныхПодразделений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала действия правил трансляции</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания действия правил трансляции</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Пользователь, ответственный за заполнение данного документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Comment>Ручная корректировка (служебный реквизит)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПравилаТрансляции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПравилоТрансляции</Name>
							<Comment>Правило трансляции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПравилаТрансляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Comment>Приоритет</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Comment>Предназначено для</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_НазначенияПравилТрансляции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Comment>Дата начала действия правила трансляции</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Comment>Дата окончания действия правила трансляции</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

bit-finance/Enums/бит_НазначенияПравилТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_НазначенияПравилТрансляции</Name>
			<Comment>(БИТ МУ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Трансляция</Name>
					<Comment>Трансляция</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодборСчетов</Name>
					<Comment>Подбор счетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодборТиповПроводок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодборСчетовДляСверкиВГО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрансляцияИПодборСчетов</Name>
					<Comment>Трансляция &amp; подбор счетов</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Documents/бит_НазначениеПравилТрансляции/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		УстановитьСостояниеДокумента();
		ЗаполнитьДанныеПериода(ЭтотОбъект);
	КонецЕсли; 
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьСостояниеДокумента();
	ЗаполнитьДанныеПериода(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		КлючеваяОперация = "Проведениебит_НазначениеПравилТрансляции";
		ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	ИзменениеДатыДействия();
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	ИзменениеДатыДействия();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПравилаТрансляции

&НаКлиенте
Процедура ПравилаТрансляцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ПравилаТрансляцииРеквизитКартинкаВыбораПериода Тогда
		ТекущиеДанные = Элементы.ПравилаТрансляции.ТекущиеДанные;
		НастроитьПериод(ТекущиеДанные.ПолучитьИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаТрансляцииПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.ПравилаТрансляции.ТекущиеДанные;
		ТекущиеДанные.ДатаНачала	= Объект.ДатаНачала;
		ТекущиеДанные.ДатаОкончания = Объект.ДатаОкончания;  
		ТекущиеДанные.Назначение    = ПредопределенноеЗначение("Перечисление.бит_НазначенияПравилТрансляции.Трансляция");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаТрансляцииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.бит_ПравилаТрансляции") Тогда
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ПравилоТрансляции", ВыбранноеЗначение);
		
		МассивСтрок = Объект.ПравилаТрансляции.НайтиСтроки(СтруктураОтбора);
		
		Если МассивСтрок.Количество() = 0 Тогда
			НайденнаяСтрока = Неопределено;
		Иначе
			НайденнаяСтрока = МассивСтрок[0];
		КонецЕсли;
		
		Если НайденнаяСтрока = Неопределено Тогда
			НоваяСтрока = Объект.ПравилаТрансляции.Добавить();
			НоваяСтрока.ПравилоТрансляции = ВыбранноеЗначение;
			НоваяСтрока.ДатаНачала        = Объект.ДатаНачала;
			НоваяСтрока.ДатаОкончания     = Объект.ДатаОкончания;
			НоваяСтрока.Назначение        = ПредопределенноеЗначение("Перечисление.бит_НазначенияПравилТрансляции.Трансляция");
		Иначе
			ТекстСообщения = НСтр("ru = 'Правило ""%1"" уже подобрано в строку № %2 табличной части ""Правила трансляции"".';
										|en = 'Rule ""%1"" is already chosen in line number %2 tables of ""broadcasting rules"".'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ВыбранноеЗначение, НайденнаяСтрока.НомерСтроки);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаТрансляцииДатаНачалаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПравилаТрансляции.ТекущиеДанные;
	ИзменениеДатыДействия(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаТрансляцииДатаОкончанияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПравилаТрансляции.ТекущиеДанные;
	ИзменениеДатыДействия(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьПериоды(Команда)

	Для каждого СтрокаТаблицы Из Объект.ПравилаТрансляции Цикл
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Объект, "ДатаНачала, ДатаОкончания");
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура НастройкаПериода(Команда)
	
	ДатаНачалаДоИзменения    = Объект.ДатаНачала;
	ДатаОкончанияДоИзменения = Объект.ДатаОкончания;
	
	НастроитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.бит_ПравилаТрансляции.ФормаВыбора",ПараметрыФормы,Элементы.ПравилаТрансляции);
	
КонецПроцедуры

&НаКлиенте
Процедура ГотовностьПравилТрансляции(Команда)
	
	Правила = Новый СписокЗначений; 
	Для каждого СтрокаТаблицы Из Объект.ПравилаТрансляции Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.ПравилоТрансляции) Тогда
			Правила.Добавить(СтрокаТаблицы.ПравилоТрансляции);
		КонецЕсли;
	КонецЦикла; 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("ПравилоТрансляции", Правила));
	ПараметрыФормы.Вставить("КлючВарианта", "ГотовностьТрансляции");
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ОткрытьФорму("Отчет.бит_ГотовностьПравилТрансляции.Форма", ПараметрыФормы, , ЭтотОбъект); 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = бит_ОбщегоНазначения.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеДатыДействия(ИдентификаторСтроки = -1)

	ТекстСообщения = НСтр("ru='Дата начала не может быть больше даты окончания.';
						|en='The start date can not be more than the end date.'");

	Если ИдентификаторСтроки = -1 Тогда
		Если Объект.ДатаОкончания <> Дата(1,1,1) И Объект.ДатаНачала > Объект.ДатаОкончания Тогда
			Объект.ДатаНачала    = ДатаНачалаДоИзменения;
			Объект.ДатаОкончания = ДатаОкончанияДоИзменения;
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ДатаНачала", "Объект");
		КонецЕсли; 
		
		ЗаполнитьДанныеПериода(ЭтотОбъект);
		
	Иначе
		
		СтрокаТаблицы = Объект.ПравилаТрансляции.НайтиПоИдентификатору(ИдентификаторСтроки); 		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ДатаОкончания) И СтрокаТаблицы.ДатаНачала > СтрокаТаблицы.ДатаОкончания Тогда
			СтрокаТаблицы.ДатаНачала 	= Объект.ДатаНачала;
			СтрокаТаблицы.ДатаОкончания	= Дата(1,1,1);
			
			Поле = "ПравилаТрансляции[%1].ДатаНачала";
			Поле = СтрШаблон(Поле, Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ="));
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , Поле, "Объект");
		КонецЕсли; 
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл Проектное решение вызвать функционал другой подсистемы.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПравилаТрансляцииДатаНачала");
	// АПК:277-вкл
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ПравилаТрансляции.ДатаНачала", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ПравилаТрансляции.ДатаОкончания", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", 			  ЦветаСтиля.бит_ТекстНедоступнойНадписи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", 				  Новый ПолеКомпоновкиДанных("ДатаНачалаПредставление"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл Проектное решение вызвать функционал другой подсистемы.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПравилаТрансляцииДатаНачала");
	// АПК:277-вкл
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ПравилаТрансляции.ДатаНачала", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ПравилаТрансляции.ДатаОкончания", ВидСравненияКомпоновкиДанных.Заполнено, "");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл Проектное решение вызвать функционал другой подсистемы.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПравилаТрансляцииДатаОкончания");
	// АПК:277-вкл
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ПравилаТрансляции.ДатаНачала", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ПравилаТрансляции.ДатаОкончания", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ТекстНедоступнойНадписи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("ДатаОкончанияПредставление")); 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДанныеПериода(Форма)

	Объект = Форма.Объект;
	
	Форма.ДатаНачалаПредставление	 = Формат(Объект.ДатаНачала,"ДЛФ=D");
	Форма.ДатаОкончанияПредставление = Формат(Объект.ДатаОкончания,"ДЛФ=D");

	Форма.ДатаНачалаДоИзменения    = Объект.ДатаНачала;
	Форма.ДатаОкончанияДоИзменения = Объект.ДатаОкончания;

КонецПроцедуры

&НаКлиенте
Асинх Процедура НастроитьПериод(ИдентификаторСтроки = - 1)

	ДатаНачалаДоИзменения    = Объект.ДатаНачала;
	ДатаОкончанияДоИзменения = Объект.ДатаОкончания;
	
	Если ИдентификаторСтроки = - 1 Тогда
		Данные = Объект;
	Иначе	
		Данные = Объект.ПравилаТрансляции.НайтиПоИдентификатору(ИдентификаторСтроки);
	КонецЕсли;
	
	Диалог		  = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Новый СтандартныйПериод(Данные.ДатаНачала, Данные.ДатаОкончания);
	
	Результат = Ждать Диалог.РедактироватьАсинх();
	
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Данные, Результат);
	
	ИзменениеДатыДействия(ИдентификаторСтроки);
	
КонецПроцедуры

#КонецОбласти
